---
title: "Merging DataFrames with merge() and join()"
date: 2020-04-12T14:41:32+02:00
author: "Othmane Rifki"
type: technical_note
draft: false
---

### Merging with specific columns

In [13]:
import pandas as pd

gold = pd.read_csv('SummerOlympic/Gold.csv')
bronze = pd.read_csv('SummerOlympic/Bronze.csv')

In [16]:
gold.head()

   NOC         Country   Total
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
3  FRA          France   378.0
4  GER         Germany   407.0

In [17]:
bronze.head()

   NOC         Country   Total
0  USA   United States  1052.0
1  URS    Soviet Union   584.0
2  GBR  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

In [12]:
combine = pd.merge(gold, bronze, on=['NOC','Country'], suffixes=['_gold','_bronze'])
print(combine)

     NOC               Country  Total_gold  Total_bronze
0    USA         United States      2088.0        1052.0
1    URS          Soviet Union       838.0         584.0
2    GBR        United Kingdom       498.0         505.0
3    FRA                France       378.0         475.0
4    GER               Germany       407.0         454.0
..   ...                   ...         ...           ...
133  SEN               Senegal         NaN           NaN
134  SUD                 Sudan         NaN           NaN
135  TGA                 Tonga         NaN           NaN
136  BDI               Burundi         1.0           NaN
137  UAE  United Arab Emirates         1.0           NaN

[138 rows x 4 columns]

### Merging on columns with non-matching labelsSpecifying columns to merge

In [24]:
revenue = pd.read_csv('Sales/revenue.csv', delim_whitespace=True)
managers = pd.read_csv('Sales/managers.csv', delim_whitespace=True)

In [23]:
revenue

          city  branch_id state  revenue
0       Austin         10    TX      100
1       Denver         20    CO       83
2  Springfield         30    IL        4
3    Mendocino         47    CA      200

In [25]:
managers

        branch  branch_id state   manager
0       Austin         10    TX  Charlers
1       Denver         20    CO      Joel
2    Mendocino         47    CA     Brett
3  Springfield         31    MO     Sally

In [26]:
combine = pd.merge(revenue, managers, left_on='city', right_on='branch')

In [27]:
combine

,city,branch_id_x,state_x,revenue,branch,branch_id_y,state_y,manager
0,Austin,10,TX,100,Austin,10,TX,Charlers
1,Denver,20,CO,83,Denver,20,CO,Joel
2,Springfield,30,IL,4,Springfield,31,MO,Sally
3,Mendocino,47,CA,200,Mendocino,47,CA,Brett

### Merging with inner/outer join 
inner join is the default behavior.

In [49]:
gold = gold.sort_values('Total',ascending=False).iloc[:5]
bronze = bronze.sort_values('Total',ascending=False).iloc[:5]

In [50]:
combine = pd.merge(gold, bronze, on=['NOC','Country'], suffixes=['_gold','_bronze'], how='inner')
print(combine.head())

   NOC         Country  Total_gold  Total_bronze
0  USA   United States      2088.0        1052.0
1  URS    Soviet Union       838.0         584.0
2  GBR  United Kingdom       498.0         505.0
3  GER         Germany       407.0         454.0

In [51]:
combine = pd.merge(gold, bronze, on=['NOC','Country'], suffixes=['_gold','_bronze'], how='outer')
print(combine.head())

   NOC         Country  Total_gold  Total_bronze
0  USA   United States      2088.0        1052.0
1  URS    Soviet Union       838.0         584.0
2  GBR  United Kingdom       498.0         505.0
3  ITA           Italy       460.0           NaN
4  GER         Germany       407.0         454.0

### Merging with left/right join (Default)
Notice that Italy was picked up from `gold` but since it does not appear in `bronze`, it gets a Not a Number (NaN) value.

In [56]:
combine = pd.merge(gold, bronze, on=['NOC','Country'], suffixes=['_gold','_bronze'], how='left')
print(combine.head())

   NOC         Country  Total_gold  Total_bronze
0  USA   United States      2088.0        1052.0
1  URS    Soviet Union       838.0         584.0
2  GBR  United Kingdom       498.0         505.0
3  ITA           Italy       460.0           NaN
4  GER         Germany       407.0         454.0

In [57]:
combine = pd.merge(gold, bronze, on=['NOC','Country'], suffixes=['_gold','_bronze'], how='right')
print(combine.head())

   NOC         Country  Total_gold  Total_bronze
0  USA   United States      2088.0        1052.0
1  URS    Soviet Union       838.0         584.0
2  GBR  United Kingdom       498.0         505.0
3  GER         Germany       407.0         454.0
4  FRA          France         NaN         475.0

### Using .join()

In [63]:
gold

   NOC         Country   Total
0  USA   United States  2088.0
1  URS    Soviet Union   838.0
2  GBR  United Kingdom   498.0
6  ITA           Italy   460.0
4  GER         Germany   407.0

In [64]:
bronze

   NOC         Country   Total
0  USA   United States  1052.0
1  URS    Soviet Union   584.0
2  GBR  United Kingdom   505.0
3  FRA          France   475.0
4  GER         Germany   454.0

In [73]:
gold.join(bronze, lsuffix='_gold', rsuffix='_bronze')

,NOC_gold,Country_gold,Total_gold,NOC_bronze,Country_bronze,Total_bronze
0,USA,United States,2088.0,USA,United States,1052.0
1,URS,Soviet Union,838.0,URS,Soviet Union,584.0
2,GBR,United Kingdom,498.0,GBR,United Kingdom,505.0
6,ITA,Italy,460.0,NaN,NaN,NaN
4,GER,Germany,407.0,GER,Germany,454.0

#### Left & right merging on multiple columns

In addition to the revenue and managers DataFrames from prior exercises, you have a DataFrame sales that summarizes units sold from specific branches (identified by city and state but not branch_id).

Once again, the managers DataFrame uses the label branch in place of city as in the other two DataFrames. Your task here is to employ left and right merges to preserve data and identify where data is missing.

By merging revenue and sales with a right merge, you can identify the missing revenue values. Here, you don't need to specify left_on or right_on because the columns to merge on have matching labels.

By merging sales and managers with a left merge, you can identify the missing manager. Here, the columns to merge on have conflicting labels, so you must specify left_on and right_on. In both cases, you're looking to figure out how to connect the fields in rows containing Springfield.

In [77]:
import pandas as pd

revenue = pd.read_csv('Sales/revenue.csv', delim_whitespace=True)
managers = pd.read_csv('Sales/managers.csv', delim_whitespace=True)
sales = pd.read_csv('Sales/sales.csv', delim_whitespace=True)

In [79]:
revenue.head()

          city  branch_id state  revenue
0       Austin         10    TX      100
1       Denver         20    CO       83
2  Springfield         30    IL        4
3    Mendocino         47    CA      200

In [80]:
managers.head()

        branch  branch_id state   manager
0       Austin         10    TX  Charlers
1       Denver         20    CO      Joel
2    Mendocino         47    CA     Brett
3  Springfield         31    MO     Sally

In [81]:
sales.head()

          city state  units
0    Mendocino    CA      1
1       Denver    CO      4
2       Austin    TX      2
3  Springfield    MO      5
4  Springfield    IL      1

In [82]:
# Merge revenue and sales: revenue_and_sales
revenue_and_sales = pd.merge(revenue,sales, how='right', on=['city','state'])

# Print revenue_and_sales
print(revenue_and_sales)

# Merge sales and managers: sales_and_managers
sales_and_managers = pd.merge(sales, managers, how='left', left_on=['city','state'], right_on=['branch','state'])

# Print sales_and_managers
print(sales_and_managers)

          city  branch_id state  revenue  units
0       Austin       10.0    TX    100.0      2
1       Denver       20.0    CO     83.0      4
2  Springfield       30.0    IL      4.0      1
3    Mendocino       47.0    CA    200.0      1
4  Springfield        NaN    MO      NaN      5
          city state  units       branch  branch_id   manager
0    Mendocino    CA      1    Mendocino       47.0     Brett
1       Denver    CO      4       Denver       20.0      Joel
2       Austin    TX      2       Austin       10.0  Charlers
3  Springfield    MO      5  Springfield       31.0     Sally
4  Springfield    IL      1          NaN        NaN       NaN

### Special care needed with inner/outer join
Notice how the default merge drops the Springfield rows, while the default outer merge includes them twice.

In [83]:
# Perform the first merge: merge_default
merge_default = pd.merge(sales_and_managers, revenue_and_sales)

# Print merge_default
print(merge_default)

# Perform the second merge: merge_outer
merge_outer = pd.merge(sales_and_managers, revenue_and_sales, how='outer')

# Print merge_outer
print(merge_outer)

# Perform the third merge: merge_outer_on
merge_outer_on = pd.merge(sales_and_managers, revenue_and_sales, how='outer', on=['city','state'])

# Print merge_outer_on
print(merge_outer_on)

        city state  units     branch  branch_id   manager  revenue
0  Mendocino    CA      1  Mendocino       47.0     Brett    200.0
1     Denver    CO      4     Denver       20.0      Joel     83.0
2     Austin    TX      2     Austin       10.0  Charlers    100.0
          city state  units       branch  branch_id   manager  revenue
0    Mendocino    CA      1    Mendocino       47.0     Brett    200.0
1       Denver    CO      4       Denver       20.0      Joel     83.0
2       Austin    TX      2       Austin       10.0  Charlers    100.0
3  Springfield    MO      5  Springfield       31.0     Sally      NaN
4  Springfield    IL      1          NaN        NaN       NaN      NaN
5  Springfield    IL      1          NaN       30.0       NaN      4.0
6  Springfield    MO      5          NaN        NaN       NaN      NaN
          city state  units_x       branch  branch_id_x   manager  \
0    Mendocino    CA        1    Mendocino         47.0     Brett
1       Denver    CO        4       Denver         20.0      Joel
2       Austin    TX        2       Austin         10.0  Charlers
3  Springfield    MO        5  Springfield         31.0     Sally
4  Springfield    IL        1          NaN          NaN       NaN

   branch_id_y  revenue  units_y
0         47.0    200.0        1
1         20.0     83.0        4
2         10.0    100.0        2
3          NaN      NaN        5
4         30.0      4.0        1